
public class 연습장 {

	public static void main(String[] args) { //1~100까지 5의배수만 출력함
		//          <<1번>>
		int sum=0;

		for(int i=1;i<=100;i++){
			if(i%5==0) {
				sum=sum+i;
			}
		}
		System.out.println("합계:"+sum);
		//           <<2번>>
		
		System.out.println();
		
		sum=0;
		for(int i=1;i<=100;i++) {
			sum += i; //
			if(i % 10 == 0) {
				System.out.println("1~"+i+"="+sum);
			}
		}
		System.out.println();
		//           <<3번>>
		sum=0;
		for(int i=1;i<=100;i++) {
			sum += i; //
			if(i % 10==0) {
				System.out.println(i-9+"~"+i+"="+sum);
				sum=0;
			}
		}
		
		

	}
}

//1. 1~100사이의 수중 5의 배수 합계구하기 5 10 15 20~100
//2. 10번에 걸쳐서 
//3. 1~100까지 10의 배수 출력 11부터21부터31부터


////1. 1~100사이의 수중 5의 배수 합계구하기 5 10 15 20~100
//2.
//1~10=55
//1~20=210
//1~30=465
//1~40=820
//1~50=1275
//1~60=1830
//1~70=2485
//1~80=3240
//1~90=4095
//1~100=5050

//3.
//1~10=55
//11~20=155
//21~30=255
//31~40=355
//41~50=455
//51~60=555
//61~70=655
//71~80=755
//81~90=855
//91~100=955

